## Лабораторная работа № 1: Основы тестирования программного обеспечения

### **Цель работы**
Изучить основные виды тестирования программного обеспечения, освоить базовые подходы к разработке тест-кейсов и на практике применить метод тестирования "черного ящика".

### **Задачи**
1. Ознакомиться с теоретическими основами тестирования.
2. Научиться составлять тестовые сценарии для проверки функциональности программного модуля.
3. Провести тестирование простого программного модуля методом "черного ящика".
4. Оформить результаты тестирования в виде отчета.

### **Оборудование и ПО**
- Компьютер с установленной средой разработки (например, Visual Studio Code, PyCharm или Eclipse).
- Язык программирования: Python, Java или C++ (по выбору преподавателя).
- Простой программный модуль для тестирования (предоставляется преподавателем).

### **Теоретическая часть**
1. Виды тестирования:
   - Тестирование методом "черного ящика" (Black Box Testing): проверка функциональности без знания внутренней структуры кода.
   - Тестирование методом "белого ящика" (White Box Testing): анализ внутренней логики и структуры кода.
2. Основные этапы тестирования:
   - Постановка задачи и определение критериев успешности.
   - Разработка тест-кейсов.
   - Исполнение тестов и анализ результатов.
3. Принципы составления тест-кейсов:
   - Проверка граничных условий.
   - Тестирование валидных и невалидных данных.

### **Ход работы**

#### 1. Подготовка
- Изучите предоставленный программный модуль. Например, это может быть функция, вычисляющая факториал числа или проверяющая, является ли число простым.
- Определите функциональные требования к модулю (например, для функции факториала: входное значение должно быть неотрицательным целым числом, результатом является произведение всех чисел от 1 до $$n$$).

#### 2. Разработка тест-кейсов
Составьте таблицу с тестовыми сценариями:

| № | Входные данные | Ожидаемый результат | Примечание          |
|---|----------------|---------------------|---------------------|
| 1 | 5              | 120                 | Валидное значение   |
| 2 | -3             | Ошибка              | Невалидное значение |
| 3 | 0              | 1                   | Граничное условие   |

#### 3. Проведение тестирования
- Реализуйте каждый из составленных тест-кейсов в коде.
- Запустите программу с указанными входными данными и зафиксируйте результаты выполнения.

#### 4. Анализ результатов
Сравните фактические результаты выполнения программы с ожидаемыми. Зафиксируйте выявленные ошибки.

#### 5. Оформление отчета
Включите в отчет:
- Цель работы.
- Теоретические сведения о методе "черного ящика".
- Таблицу с тест-кейсами и результатами выполнения.
- Выводы о корректности работы модуля.

### **Индивидуальное задание**
Для каждого ученика можно предложить разные модули для тестирования (например, функции для вычисления суммы чисел, проверки палиндромов или сортировки массива).

### **Критерии оценки**
- Полнота и корректность составленных тест-кейсов.
- Правильность выполнения программы и анализа результатов.
- Качество оформления отчета.





**Подробное руководство по выполнению практической части**

#### **1. Подготовка**
1. Ознакомьтесь с заданием и программным модулем, который необходимо протестировать. Например, это может быть функция, вычисляющая факториал числа:
   ```python
   def factorial(n):
       if n < 0:
           return "Ошибка: число должно быть неотрицательным"
       elif n == 0 or n == 1:
           return 1
       else:
           result = 1
           for i in range(2, n + 1):
               result *= i
           return result
   ```
2. Поймите, что делает программа:
   - Входные данные: целое число $$n$$.
   - Выходные данные: факториал числа $$n$$ (или сообщение об ошибке, если число отрицательное).

3. Определите функциональные требования:
   - Программа должна возвращать корректное значение факториала для всех неотрицательных чисел.
   - Для отрицательных чисел программа должна выдавать сообщение об ошибке.
   - Программа должна корректно обрабатывать граничные значения (например, $$n = 0$$).

---

#### **2. Разработка тест-кейсов**
1. Создайте таблицу тест-кейсов (можно на бумаге или в текстовом редакторе). Укажите входные данные, ожидаемый результат и примечания.

Пример таблицы:

| №  | Входные данные | Ожидаемый результат               | Примечание                  |
|----|----------------|-----------------------------------|-----------------------------|
| 1  | 5              | 120                               | Валидное значение           |
| 2  | 0              | 1                                 | Граничное условие           |
| 3  | -3             | "Ошибка: число должно быть неотрицательным" | Невалидное значение         |
| 4  | 1              | 1                                 | Граничное условие           |
| 5  | "abc"          | Ошибка выполнения (тип данных)    | Некорректный тип данных     |

2. Убедитесь, что тест-кейсы покрывают все возможные сценарии:
   - Валидные значения.
   - Невалидные значения.
   - Граничные условия.
   - Некорректный тип данных.

---

#### **3. Реализация тестирования**
1. Откройте среду разработки (например, PyCharm или VS Code).
2. Создайте новый файл и вставьте предоставленный программный модуль.
3. Напишите код для выполнения тестов. Например:

```python
# Тестируемая функция
def factorial(n):
    if n < 0:
        return "Ошибка: число должно быть неотрицательным"
    elif n == 0 or n == 1:
        return 1
    else:
        result = 1
        for i in range(2, n + 1):
            result *= i
        return result

# Тест-кейсы
test_cases = [
    {"input": 5, "expected": 120},
    {"input": 0, "expected": 1},
    {"input": -3, "expected": "Ошибка: число должно быть неотрицательным"},
    {"input": "abc", "expected": "Ошибка выполнения"}
]

# Выполнение тестов
for i, test in enumerate(test_cases):
    try:
        result = factorial(test["input"])
        assert result == test["expected"], f"Тест {i + 1} провален: ожидалось {test['expected']}, получено {result}"
        print(f"Тест {i + 1} пройден")
    except Exception as e:
        print(f"Тест {i + 1} провален: {e}")
```

4. Запустите программу и зафиксируйте результаты выполнения.

---

#### **4. Анализ результатов**
1. Сравните фактические результаты выполнения программы с ожидаемыми результатами из таблицы тест-кейсов.
2. Если обнаружены ошибки:
   - Опишите их (например: программа не обрабатывает некорректный тип данных).
   - Предложите возможные способы исправления кода.

Пример анализа:
- Тест №5 ("abc") завершился с ошибкой выполнения, так как программа ожидает числовое значение. Для исправления можно добавить проверку типа данных в начале функции.

---

#### **5. Оформление отчета**
Создайте отчет о проделанной работе в текстовом редакторе (например, Word). Включите в него следующие разделы:

- **Цель работы**: Краткое описание цели лабораторной работы.
- **Ход работы**:
   - Таблица тест-кейсов.
   - Код программы и результаты выполнения тестов.
- **Выводы**:
   - Оценка корректности работы программы.
   - Выявленные ошибки и их анализ.
   - Предложения по улучшению программы.

Пример вывода:
> В ходе лабораторной работы было протестировано пять сценариев. Четыре из них успешно прошли тестирование, один завершился с ошибкой выполнения из-за отсутствия проверки типа входных данных. Для устранения проблемы рекомендуется добавить проверку типа данных в функцию.

---

#### **6. Дополнительное задание (по желанию)**
Для закрепления навыков предложите ученикам самостоятельно написать функцию для другой задачи (например, проверка числа на простоту) и составить для неё собственные тест-кейсы.

Эти шаги помогут ученикам последовательно освоить процесс тестирования программного обеспечения и научиться выявлять ошибки в коде.
